{
    "title": "A Pattern Sequence for Designing Blockchain-Based Healthcare Information Technology Systems",
    "authors": [
        "Peng Zhang",
        "Douglas C. Schmidt",
        "Jules White"
    ],
    "summary": "Known for its decentralized and tamper-aware properties, blockchain is\nattractive to enhance the infrastructure of systems that have been constrained\nby traditionally centralized and vendor-locked environments. Although\nblockchain has commonly been used as the operational model behind\ncryptocurrency, it has far more foreseeable utilities in domains like\nhealthcare, where efficient data flow is highly demanded. Particularly,\nblockchain and related technologies have been touted as foundational\ntechnologies for addressing healthcare interoperability challenges, such as\npromoting effective communications and securing data exchanges across various\nhealthcare systems. Despite the increasing interests in leveraging blockchain\ntechnology to improve healthcare infrastructures, a major gap in literature is\nthe lack of available recommendations for concrete architectural styles and\ndesign considerations for creating blockchain-based apps and systems with a\nhealthcare focus. This research provides two contributions to bridge the gap in\nexisting research. First, we introduce a pattern sequence for designing\nblockchain-based healthcare systems focused on secure and at-scale data\nexchange. Our approach adapts traditional software patterns and proposes novel\npatterns that take into account both the technical requirements specific to\nhealthcare systems and the implications of these requirements on naive\nblockchain-based solutions. Second, we provide a pattern-oriented reference\narchitecture using an example application of the pattern sequence for guiding\nsoftware developers to design interoperable (on the technical level) healthcare\nIT systems atop blockchain-based infrastructures. The reference architecture\nfocuses on minimizing storage requirements on-chain, preserving the privacy of\nsensitive information, facilitating scalable communications, and maximizing\nevolvability of the system.",
    "pdf_url": "http://arxiv.org/pdf/2010.01172v1"
}